{
  "plan_text": "### 7-Day Micro-Task Plan for SQL Joins\n\n#### Day 1 — Understand\n- **Task 1 (est. 15–25 min)** — Review the definitions and differences between `INNER JOIN`, `LEFT JOIN`, and `RIGHT JOIN`. Take notes on when to use each type. [CITATION: 1]\n- **Task 2 (est. 10–20 min)** — Read through the SQL JOIN examples provided in the course materials and write down the SQL syntax for each type of join. [CITATION: 3]\n\n#### Day 2 — Apply\n- **Task 1 (est. 20–30 min)** — Use the interactive SQL playground to practice writing `INNER JOIN` queries. Experiment with different tables and columns. [CITATION: 6]\n- **Task 2 (est. 15–25 min)** — Complete a coding exercise that requires you to write `LEFT JOIN` queries based on provided datasets. [CITATION: 1]\n\n#### Day 3 — Review\n- **Task 1 (est. 15–25 min)** — Revisit your notes from Day 1 and summarize the key points about SQL JOINs. Focus on the differences between join types. [CITATION: 1]\n- **Task 2 (est. 10–20 min)** — Go through the SQL JOIN examples again and try to explain them in your own words. [CITATION: 3]\n\n#### Day 4 — Apply\n- **Task 1 (est. 20–30 min)** — Write SQL queries using `RIGHT JOIN` and `FULL OUTER JOIN` in the interactive SQL playground. Test different scenarios. [CITATION: 3]\n- **Task 2 (est. 15–25 min)** — Solve SQL Leetcode questions that focus on JOIN operations. [CITATION: 7]\n\n#### Day 5 — Reflect\n- **Task 1 (est. 15–25 min)** — Reflect on the challenges faced while writing JOIN queries. Write down any specific areas where you feel less confident. [CITATION: 1]\n- **Task 2 (est. 10–20 min)** — Discuss your reflections with a peer or mentor, focusing on the differences between the join types. [CITATION: 1]\n\n#### Day 6 — Review\n- **Task 1 (est. 15–25 min)** — Go over your notes and reflections from Days 1 and 5. Create a comparison chart for `INNER JOIN`, `LEFT JOIN`, and `RIGHT JOIN`. [CITATION: 1]\n- **Task 2 (est. 10–20 min)** — Revisit the SQL JOIN examples and practice writing queries for each type again, ensuring you understand their outputs. [CITATION: 3]\n\n#### Day 7 — Checkpoint\n- **Task 1 (est. 30 min)** — Complete a mini-quiz or small coding task that requires you to write queries using all types of joins. Assess your understanding based on the results. [CITATION: 1]\n- **Task 2 (est. 15 min)** — Review the quiz results and identify any areas that still need improvement. Plan next steps for further practice. [CITATION: 1]\n\nThis structured plan will help reinforce your understanding of SQL JOINs and improve your coding skills in this area."
}